Documents/ПогашениеКупона.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>ПогашениеКупона</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ЗадолженностиПоДенежнымСредствам</xr:Item>
				<xr:Item>AccumulationRegister.БухПартииЦенныхБумагПроданныеВРепо</xr:Item>
				<xr:Item>AccountingRegister.БухгалтерскийУчет</xr:Item>
				<xr:Item>InformationRegister.ОперацииСЦеннымиБумагами</xr:Item>
				<xr:Item>AccountingRegister.ЕдиныйБухгалтерскийУчет</xr:Item>
				<xr:Item>AccumulationRegister.БухПартииЦенныхБумаг</xr:Item>
				<xr:Item>AccumulationRegister.БухПартииЦенныхБумагКупленныеПоРЕПО</xr:Item>
				<xr:Item>AccountingRegister.НалоговыйУчет</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Облигация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Облигации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаФиксации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаНаОднуОблигацию</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиЦена</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Брокер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БрокерскиеКомпании</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасчетныйСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаОплаты</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиКоличествоЦелое</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаКупона</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиСумма</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаНаОднуОблигациюВРублях</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиЦена</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаКупонаВРублях</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиСумма</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

AccumulationRegisters/ЗадолженностиПоЦеннымБумагам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<AccumulationRegister>
		<Properties>
			<Name>ЗадолженностиПоЦеннымБумагам</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиКоличество</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиСумма</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаКупона</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиСумма</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Содержание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОснованиеЗадолженностиПоЦеннымБумагам</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипЗадолженности</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыЗадолженности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидЗадолженности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЗадолженности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Рынок</Name>
					<Type>
						<v8:Type>cfg:EnumRef.РынкиЦенныхБумаг</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЦеннаяБумага</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумаги</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccumulationRegisters/ЗадолженностиПоВторойЧастиРЕПО.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<AccumulationRegister>
		<Properties>
			<Name>ЗадолженностиПоВторойЧастиРЕПО</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиКоличество</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиСумма</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаКупона</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиСумма</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Содержание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>СделкаРЕПО</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.СделкаРЕПО</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипЗадолженности</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыЗадолженности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Рынок</Name>
					<Type>
						<v8:Type>cfg:EnumRef.РынкиЦенныхБумаг</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЦеннаяБумага</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумаги</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccumulationRegisters/ОстаткиЦенныхБумаг.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<AccumulationRegister>
		<Properties>
			<Name>ОстаткиЦенныхБумаг</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиКоличество</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Содержание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДепозитарныйСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДепозитарныеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Рынок</Name>
					<Type>
						<v8:Type>cfg:EnumRef.РынкиЦенныхБумаг</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЦеннаяБумага</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумаги</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Enums/ТипыЗадолженности.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ТипыЗадолженности</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Дебиторская</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Кредиторская</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/РынкиЦенныхБумаг.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>РынкиЦенныхБумаг</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Акции</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Облигации</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Паи</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Векселя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Закладные</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИпотечныеСертификатыУчастия</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДепозитарныеРасписки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Фьючерсы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Опционы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВалютныеПары</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Доли</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДрагоценныеМеталлы</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ВидыУчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ВидыУчета</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>БухгалтерскийУчет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НалоговыйУчет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЕдиныйБухгалтерскийУчет</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/ПогашениеКупона/Ext/ManagerModule.bsl
Функция НКЦпоРЕПОсЦК(ДатаДок) Экспорт
	//Хардкод: дата начала подстановки контрагента НКЦ вместо брокера в прямых РЕПО с ЦК
	Возврат ДатаДок >= Дата(2025, 9, 18);
КонецФункции

Функция ОпределитьКоличествоБумагПоРЕПО(ДокументСсылка) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 	
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЗадолженностиПоЦеннымБумагамОстатки.Основание,
		|	ЗадолженностиПоЦеннымБумагамОстатки.ВидЗадолженности,
		|	ЗадолженностиПоЦеннымБумагамОстатки.ТипЗадолженности,
		|	ЗадолженностиПоЦеннымБумагамОстатки.КоличествоОстаток
		|ПОМЕСТИТЬ ВТ_ЗадолженностиПоЦеннымБумагамОстатки
		|ИЗ
		|	РегистрНакопления.ЗадолженностиПоЦеннымБумагам.Остатки(
		|			&ДатаФиксации,
		|			(ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоПервойЧастиРЕПО)
		|				ИЛИ ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоВторойЧастиРЕПО))
		|				И Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления
		|				И Рынок = &Рынок
		|				И ЦеннаяБумага = &ЦеннаяБумага) КАК ЗадолженностиПоЦеннымБумагамОстатки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВТ_ЗадолженностиПоЦеннымБумагамПоВторойЧастиРЕПО.Основание,
		|	ВЫБОР
		|		КОГДА ВТ_ЗадолженностиПоЦеннымБумагамПоВторойЧастиРЕПО.Основание.СделкаСЦентральнымКонтрагентом И &НКЦпоРЕПОсЦК
		|			ТОГДА ВТ_ЗадолженностиПоЦеннымБумагамПоВторойЧастиРЕПО.Основание.Контрагент
		|		КОГДА ВТ_ЗадолженностиПоЦеннымБумагамПоВторойЧастиРЕПО.Основание.Брокер <> ЗНАЧЕНИЕ(Справочник.БрокерскиеКомпании.ПустаяСсылка)
		|			ТОГДА ВТ_ЗадолженностиПоЦеннымБумагамПоВторойЧастиРЕПО.Основание.Брокер.ЮрФизЛицо
		|		ИНАЧЕ ВТ_ЗадолженностиПоЦеннымБумагамПоВторойЧастиРЕПО.Основание.Контрагент
		|	КОНЕЦ КАК Контрагент,
		|	0 КАК КоличествоОстаток,
		|	ВЫБОР
		|		КОГДА ВТ_ЗадолженностиПоЦеннымБумагамПоВторойЧастиРЕПО.ТипЗадолженности = ЗНАЧЕНИЕ(Перечисление.ТипыЗадолженности.Дебиторская)
		|			ТОГДА ВТ_ЗадолженностиПоЦеннымБумагамПоВторойЧастиРЕПО.КоличествоОстаток - ЕСТЬNULL(ВТ_ЗадолженностиПоЦеннымБумагамПоПервойЧастиРЕПО.КоличествоОстаток, 0)
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК КоличествоВРЕПО,
		|	ВЫБОР
		|		КОГДА ВТ_ЗадолженностиПоЦеннымБумагамПоВторойЧастиРЕПО.ТипЗадолженности = ЗНАЧЕНИЕ(Перечисление.ТипыЗадолженности.Кредиторская)
		|			ТОГДА ВТ_ЗадолженностиПоЦеннымБумагамПоВторойЧастиРЕПО.КоличествоОстаток - ЕСТЬNULL(ВТ_ЗадолженностиПоЦеннымБумагамПоПервойЧастиРЕПО.КоличествоОстаток, 0)
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК КоличествоПоРЕПО
		|ПОМЕСТИТЬ ВТ_КоличествоРЕПО
		|ИЗ
		|	ВТ_ЗадолженностиПоЦеннымБумагамОстатки КАК ВТ_ЗадолженностиПоЦеннымБумагамПоВторойЧастиРЕПО
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ЗадолженностиПоЦеннымБумагамОстатки КАК ВТ_ЗадолженностиПоЦеннымБумагамПоПервойЧастиРЕПО
		|		ПО ВТ_ЗадолженностиПоЦеннымБумагамПоВторойЧастиРЕПО.Основание = ВТ_ЗадолженностиПоЦеннымБумагамПоПервойЧастиРЕПО.Основание
		|			И (ВТ_ЗадолженностиПоЦеннымБумагамПоПервойЧастиРЕПО.ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоПервойЧастиРЕПО))
		|ГДЕ
		|	ВТ_ЗадолженностиПоЦеннымБумагамПоВторойЧастиРЕПО.ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоВторойЧастиРЕПО)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЗадолженностиПоВторойЧастиРЕПООстатки.СделкаРЕПО,
		|	ВЫБОР
		|		КОГДА ЗадолженностиПоВторойЧастиРЕПООстатки.СделкаРЕПО.СделкаСЦентральнымКонтрагентом И &НКЦпоРЕПОсЦК
		|			ТОГДА ЗадолженностиПоВторойЧастиРЕПООстатки.СделкаРЕПО.Контрагент
		|		КОГДА ЗадолженностиПоВторойЧастиРЕПООстатки.СделкаРЕПО.Брокер <> ЗНАЧЕНИЕ(Справочник.БрокерскиеКомпании.ПустаяСсылка)
		|			ТОГДА ЗадолженностиПоВторойЧастиРЕПООстатки.СделкаРЕПО.Брокер.ЮрФизЛицо
		|		ИНАЧЕ ЗадолженностиПоВторойЧастиРЕПООстатки.СделкаРЕПО.Контрагент
		|	КОНЕЦ,
		|	0,
		|	ВЫБОР
		|		КОГДА ЗадолженностиПоВторойЧастиРЕПООстатки.ТипЗадолженности = ЗНАЧЕНИЕ(Перечисление.ТипыЗадолженности.Кредиторская)
		|			ТОГДА ЗадолженностиПоВторойЧастиРЕПООстатки.КоличествоОстаток
		|		ИНАЧЕ 0
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА ЗадолженностиПоВторойЧастиРЕПООстатки.ТипЗадолженности = ЗНАЧЕНИЕ(Перечисление.ТипыЗадолженности.Дебиторская)
		|			ТОГДА ЗадолженностиПоВторойЧастиРЕПООстатки.КоличествоОстаток
		|		ИНАЧЕ 0
		|	КОНЕЦ
		|ИЗ
		|	РегистрНакопления.ЗадолженностиПоВторойЧастиРЕПО.Остатки(
		|			&ДатаФиксации,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления
		|				И Рынок = &Рынок
		|				И ЦеннаяБумага = &ЦеннаяБумага) КАК ЗадолженностиПоВторойЧастиРЕПООстатки
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	&Основание,
		|	ОстаткиЦенныхБумагОстатки.ЦеннаяБумага.Эмитент.ЮрФизЛицо,
		|	ОстаткиЦенныхБумагОстатки.КоличествоОстаток,
		|	0,
		|	0
		|ИЗ
		|	РегистрНакопления.ОстаткиЦенныхБумаг.Остатки(
		|			&ДатаФиксации,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления
		|				И Рынок = &Рынок
		|				И ЦеннаяБумага = &ЦеннаяБумага) КАК ОстаткиЦенныхБумагОстатки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВТ_КоличествоРЕПО.Основание,
		|	ВТ_КоличествоРЕПО.Контрагент,
		|	ВТ_КоличествоРЕПО.КоличествоОстаток,
		|	ВТ_КоличествоРЕПО.КоличествоВРЕПО,
		|	ВТ_КоличествоРЕПО.КоличествоПоРЕПО
		|ИЗ
		|	ВТ_КоличествоРЕПО КАК ВТ_КоличествоРЕПО";
		
	Запрос.УстановитьПараметр("СчетДоверительногоУправления", ДокументСсылка.СчетДоверительногоУправления);
	Запрос.УстановитьПараметр("Основание"					, ДокументСсылка);
	Запрос.УстановитьПараметр("Организация"					, ДокументСсылка.Организация);
	Запрос.УстановитьПараметр("Рынок"						, Перечисления.РынкиЦенныхБумаг.Облигации);
	Запрос.УстановитьПараметр("ЦеннаяБумага"				, ДокументСсылка.Облигация);
	Запрос.УстановитьПараметр("ДатаФиксации"				, ?(ДокументСсылка.ДатаФиксации = НачалоДня(ДокументСсылка.Дата), НачалоДня(ДокументСсылка.ДатаФиксации), КонецДня(ДокументСсылка.ДатаФиксации)));
	Запрос.УстановитьПараметр("НКЦпоРЕПОсЦК"				, НКЦпоРЕПОсЦК(ДокументСсылка.Дата));
	
	ОбщееКоличествоПоРЕПО = 0;
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		Если ЗначениеЗаполнено(Выборка.КоличествоПоРЕПО) Тогда
		
			КоличествоПоРЕПО = Выборка.КоличествоПоРЕПО;
			СуммаПоРЕПО = КоличествоПоРЕПО * ДокументСсылка.СуммаНаОднуОблигацию;
			
			ОбщееКоличествоПоРЕПО = ОбщееКоличествоПоРЕПО + КоличествоПоРЕПО;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат ОбщееКоличествоПоРЕПО;

КонецФункции

Функция ПодготовитьНаборПроводок(ДокументСсылка, Дата, Организация, СчетДоверительногоУправления, ВидЗадолженности = Неопределено, УчетныйРегистр, Отказ, ЭтоПроведениеНачисления = Ложь) Экспорт
	
	Движения = РегистрыБухгалтерии[УчетныйРегистр].СоздатьНаборЗаписей();
	
	Если Не ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.ПогашениеКупона") Тогда
		Возврат Движения;
	КонецЕсли;
	
	// #414504 - пришел купон а бумаги по Т+ ушли
	Если СчетДоверительногоУправления = ОбщегоНазначения.ПолучитьИменованныйОбъект("СчетДУ_ПФР_РЭМ")
		И НачалоДня(Дата) = '20220110' Тогда
	
		Возврат Движения;	
	
	КонецЕсли;
	
	ДанныеДокумента = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДокументСсылка, "Облигация, СуммаКупона, ВалютаОплаты, СуммаНаОднуОблигацию");
	Облигация       = ДанныеДокумента.Облигация;
	СуммаКупона		= ДанныеДокумента.СуммаКупона;
	ВалютаОплаты    = ДанныеДокумента.ВалютаОплаты;
	
	ВалютаНоминала 	= ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Облигация, "ВалютаНоминала");
	ВалютаУчета 	= ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Организация, "ВалютаУчета");
	//ВалютныйУчет   = ВалютаНоминала <> ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Организация, "ВалютаУчета");
	
	// #361945 - по Облигация_ДП_О1ГрФин1P3, Облигация_АрчерФинанс, Облигация_ОткрытиеХолдинг клиенты Будущее(с 11/2/21) и Телеком(с 10/2/21) отключили расчет НКД
	Клиент = Справочники.СчетаДоверительногоУправления.КлиентДоверительногоУправления(СчетДоверительногоУправления, Дата);
	
	ЭтоКлиентБудущее = (Клиент = ОбщегоНазначения.ПолучитьИменованныйОбъект("Клиент_БУДУЩЕЕ"));
	ЭтоКлиентТелеком = (Клиент = ОбщегоНазначения.ПолучитьИменованныйОбъект("Клиент_ТелекомСоюз"));
	
	Если ЭтоКлиентТелеком И НачалоДня(Дата) >= '20210210'
		ИЛИ ЭтоКлиентБудущее И НачалоДня(Дата) >= '20210211' Тогда
		
		Если Облигация = ОбщегоНазначения.ПолучитьИменованныйОбъект("Облигация_АрчерФинанс")
			ИЛИ Облигация = ОбщегоНазначения.ПолучитьИменованныйОбъект("Облигация_О1_Груп_Финанс") 
			ИЛИ Облигация = ОбщегоНазначения.ПолучитьИменованныйОбъект("Облигация_ДП_О1ГрФин1P3") 
			ИЛИ Облигация = ОбщегоНазначения.ПолучитьИменованныйОбъект("Облигация_ОткрытиеХолдинг") Тогда
			
			Возврат Движения;	
			
		КонецЕсли;
	КонецЕсли;
	
	Если ВалютаНоминала = ВалютаУчета Тогда
		СчетПогашениеКупона = ПланыСчетов.Основной.ПогашениеКупона;
	Иначе
		СчетПогашениеКупона = ПланыСчетов.Основной.ПогашениеКупонаЕврооблигации;
	КонецЕсли;
	
	УчетныйАктив 	= БухгалтерскийУчет.ОпределитьУчетныйАктив(Дата, Перечисления.РынкиЦенныхБумаг.Облигации, Облигация, Истина);
	
	НастройкиУчетаАктива = БухгалтерскийУчет.ОпределитьНастройкиУчетаАктива(
		Дата,
		Организация,
		СчетДоверительногоУправления,
		УчетныйАктив,
		УчетныйРегистр);		
		
	УчетныйАктивОблигация = БухгалтерскийУчет.ОпределитьУчетныйАктив(Дата, Перечисления.РынкиЦенныхБумаг.Облигации, Облигация, Ложь);
	
	НастройкиУчетаАктиваОблигация = БухгалтерскийУчет.ОпределитьНастройкиУчетаАктива(
		Дата,
		Организация,
		СчетДоверительногоУправления,
		УчетныйАктивОблигация,
		УчетныйРегистр);		
		
	ОбращаетсяНаОРЦБ = БухгалтерскийУчет.ПолучитьСведенияОбОбращенииЦеннойБумагиНаОРЦБ(Дата, Облигация, УчетныйРегистр);
	
	ДвиженияРЕПО = ПроводкиПоКупленнымПоРЕПО(ДокументСсылка, Движения, УчетныйРегистр, НастройкиУчетаАктива, НастройкиУчетаАктиваОблигация, УчетныйАктив, УчетныйАктивОблигация, ВалютаНоминала, ВалютаОплаты, ВалютаУчета, СчетПогашениеКупона, ОбращаетсяНаОРЦБ, ЭтоПроведениеНачисления, Отказ);
	
	СуммаКупона = СуммаКупона - ДвиженияРЕПО.СуммаВРЕПО - ДвиженияРЕПО.СуммаПоРЕПО;
	
	Если СуммаКупона < 0 Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("После учета суммы купона по бумагам, купленным по РЕПО, к распределению по собственным партиям осталась отрицательная сумма! Документ не проведен по виду учета!", ДокументСсылка,,,Отказ);
		Возврат Движения;
	КонецЕсли;
			
	МетодОпределенияДоходовИРасходов = БухгалтерскийУчет.ОпределитьНастройкуДляВидаУчета(
		Дата, 
		Организация, 
		СчетДоверительногоУправления,
		УчетныйРегистр,
		"МетодОпределенияДоходовИРасходов");
		
	Если Не ЗначениеЗаполнено(МетодОпределенияДоходовИРасходов) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("В настройках по виду учета " + УчетныйРегистр + " не указан метод определения доходов и расходов. Документ не проведен по виду учета!", ДокументСсылка,,,Отказ);
		Возврат Движения;
	КонецЕсли;
	
	Если МетодОпределенияДоходовИРасходов = Перечисления.МетодыОпределенияДоходовИРасходов.Кассовый И ЭтоПроведениеНачисления Тогда
		Возврат Движения;
	КонецЕсли;
	
	ИтогоДоход = 0; // используется для облигаций с индексируемым номиналом. Только госы РФ
	
	//читаем движения партий
	// В налоговом учете перекурсовок нет, для проводок используем суммы списания по партиям
	Запрос = Новый Запрос;
		
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СУММА(БухПартииЦенныхБумаг.СтоимостьКупона) КАК СтоимостьКупона,
		|	СУММА(БухПартииЦенныхБумаг.ПереоценкаКупона) КАК ПереоценкаКупона,
		|	СУММА(БухПартииЦенныхБумаг.СтоимостьКупонаВВалютеУчета) КАК СтоимостьКупонаВВалютеУчета,
		|	СУММА(БухПартииЦенныхБумаг.ПереоценкаКупонаВВалютеУчета) КАК ПереоценкаКупонаВВалютеУчета,
		|	ВЫБОР
		|		КОГДА БухПартииЦенныхБумаг.СтоимостьКупона = 0
		|				И БухПартииЦенныхБумаг.ПереоценкаКупона = 0
		|				И БухПартииЦенныхБумаг.ИндексацияНоминала = 0
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК Перекурсовка,
		|	СУММА(БухПартииЦенныхБумаг.СтоимостьВВалютеУчета) КАК СтоимостьВВалютеУчета,
		|	СУММА(БухПартииЦенныхБумаг.ПереоценкаВВалютеУчета) КАК ПереоценкаВВалютеУчета,
		|	ВЫБОР
		|		КОГДА БухПартииЦенныхБумаг.Количество = 0
		|				И БухПартииЦенныхБумаг.ПереоценкаКупона <> 0
		|				И БухПартииЦенныхБумаг.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК ДооценкаКупона,
		|	СУММА(БухПартииЦенныхБумаг.ИндексацияНоминала) КАК ИндексацияНоминала,
		|	ВЫБОР
		|		КОГДА БухПартииЦенныхБумаг.СтоимостьКупона = 0
		|				И БухПартииЦенныхБумаг.ПереоценкаКупона = 0
		|				И БухПартииЦенныхБумаг.ИндексацияНоминала <> 0
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК ДвижениеИндексацииНоминала
		|ИЗ
		|	РегистрНакопления.БухПартииЦенныхБумаг КАК БухПартииЦенныхБумаг
		|ГДЕ
		|	БухПартииЦенныхБумаг.Регистратор = &Регистратор
		|	И БухПартииЦенныхБумаг.ВидУчета = &ВидУчета
		|
		|СГРУППИРОВАТЬ ПО
		|	ВЫБОР
		|		КОГДА БухПартииЦенныхБумаг.СтоимостьКупона = 0
		|				И БухПартииЦенныхБумаг.ПереоценкаКупона = 0
		|				И БухПартииЦенныхБумаг.ИндексацияНоминала = 0
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА БухПартииЦенныхБумаг.СтоимостьКупона = 0
		|				И БухПартииЦенныхБумаг.ПереоценкаКупона = 0
		|				И БухПартииЦенныхБумаг.ИндексацияНоминала <> 0
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА БухПартииЦенныхБумаг.Количество = 0
		|				И БухПартииЦенныхБумаг.ПереоценкаКупона <> 0
		|				И БухПартииЦенныхБумаг.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ
		|
		|УПОРЯДОЧИТЬ ПО
		|	Перекурсовка УБЫВ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	НалоговыйУчетОстатки.Субконто1 КАК ЦеннаяБумага,
		|	НалоговыйУчетОстатки.СуммаОстаток КАК Сумма
		|ИЗ
		|	РегистрБухгалтерии.НалоговыйУчет.Остатки(
		|			&ДоДокумента,
		|			Счет = &Счет97,
		|			&ВидыСубконто,
		|			Субконто1 = &Облигация
		|				И Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК НалоговыйУчетОстатки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	БухПартииЦенныхБумагОстатки.КоличествоОстаток КАК КоличествоОстаток
		|ИЗ
		|	РегистрНакопления.БухПартииЦенныхБумаг.Остатки(
		|			&ДатаФиксацииУтро,
		|			СчетДоверительногоУправления = &СчетДоверительногоУправления
		|				И ВидУчета = &ВидУчета
		|				И ЦеннаяБумага = &Облигация) КАК БухПартииЦенныхБумагОстатки";
		
	Запрос.УстановитьПараметр("Регистратор", ДокументСсылка);
	Запрос.УстановитьПараметр("ВидУчета",    Перечисления.ВидыУчета[УчетныйРегистр]);
	Запрос.УстановитьПараметр("Приход",    	 ВидДвиженияНакопления.Приход);
	Запрос.УстановитьПараметр("ВидУчетаНУ",  Перечисления.ВидыУчета[УчетныйРегистр] = Перечисления.ВидыУчета.НалоговыйУчет);

	Запрос.УстановитьПараметр("ДоДокумента", Новый Граница(ДокументСсылка.МоментВремени(), ВидГраницы.Исключая));
	Запрос.УстановитьПараметр("ДатаФиксацииУтро", НачалоДня(ДокументСсылка.ДатаФиксации));
	Запрос.УстановитьПараметр("Облигация", 	 Облигация);
	Запрос.УстановитьПараметр("Счет97", 	 ПланыСчетов.Основной.РасходыБудущихПериодов);
	
	ВидыСубконто = Новый Массив;
    ВидыСубконто.Добавить(ПланыВидовХарактеристик.ВидыСубконто.ЦенныеБумаги);
    ВидыСубконто.Добавить(ПланыВидовХарактеристик.ВидыСубконто.ПрочиеДоходыИРасходы);
    Запрос.УстановитьПараметр("ВидыСубконто", ВидыСубконто);	
	
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("СчетДоверительногоУправления", СчетДоверительногоУправления);
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "НалоговыйУчет", УчетныйРегистр);

	РезультатЗапроса = Запрос.ВыполнитьПакет();
	Выборка = РезультатЗапроса[0].Выбрать();
	ТаблицаНепринимаемойИндексацииНоминалов = РезультатЗапроса[1].Выгрузить();
	ВыборкаКоличество = РезультатЗапроса[2].Выбрать();
	
	КоличествоПоПартиям = 0;
	Если ВыборкаКоличество.Следующий() Тогда
		КоличествоПоПартиям = ВыборкаКоличество.КоличествоОстаток;
	КонецЕсли;
	
	СтоимостьКупона  = 0;
	СтоимостьКупонаВВалютеУчета  = 0;
	ПереоценкаКупона = 0;
	ПереоценкаКупонаВВалютеУчета = 0;
	ДооценкаИндексацииНоминала = 0;
	ДооценкаКупона = 0;
	ДооценкаКупонаВВалютеУчета = 0;
	
	СтруктураОбъекта = Новый Структура("Ссылка, Дата, Движения", ДокументСсылка, Дата, Движения); 
	
	Пока Выборка.Следующий() Цикл
		Если Выборка.Перекурсовка  Тогда
			ПараметрыПерекурсовки = Новый Структура("ЦеннаяБумага, Рынок,"
				+ "СтоимостьВВалютеУчета, СтоимостьКупонаВВалютеУчета, ПереоценкаВВалютеУчета, ПереоценкаКупонаВВалютеУчета",
				Облигация, Перечисления.РынкиЦенныхБумаг.Облигации,
				Выборка.СтоимостьВВалютеУчета, Выборка.СтоимостьКупонаВВалютеУчета,  Выборка.ПереоценкаВВалютеУчета, Выборка.ПереоценкаКупонаВВалютеУчета);
				
			СчетаУчета = Новый Структура;
			СчетаУчета.Вставить(УчетныйАктивОблигация.ИмяПредопределенныхДанных, НастройкиУчетаАктиваОблигация.СчетУчета);
			СчетаУчета.Вставить(УчетныйАктив.ИмяПредопределенныхДанных, НастройкиУчетаАктива.СчетУчета);
			
			СчетаУчетаПереоценки = Новый Структура;
			СчетаУчетаПереоценки.Вставить(УчетныйАктивОблигация.ИмяПредопределенныхДанных, НастройкиУчетаАктиваОблигация.СчетУчетаПереоценки);
			СчетаУчетаПереоценки.Вставить(УчетныйАктив.ИмяПредопределенныхДанных, НастройкиУчетаАктива.СчетУчетаПереоценки);
			
			АналитикаПерекурсовки = Новый Структура;
			АналитикаПерекурсовки.Вставить(УчетныйАктивОблигация.ИмяПредопределенныхДанных, НастройкиУчетаАктиваОблигация.АналитикаПерекурсовки);
			АналитикаПерекурсовки.Вставить(УчетныйАктив.ИмяПредопределенныхДанных, НастройкиУчетаАктива.АналитикаПерекурсовки);
			
			БухгалтерскийУчет.ДвижениеПерекурсовки(СтруктураОбъекта, УчетныйРегистр, ПараметрыПерекурсовки, АналитикаПерекурсовки,  СчетаУчета, СчетаУчетаПереоценки, ОбращаетсяНаОРЦБ, Отказ);		
			
		ИначеЕсли Выборка.ДвижениеИндексацииНоминала  Тогда
			ДооценкаИндексацииНоминала 			= Выборка.ИндексацияНоминала;
		ИначеЕсли Выборка.ДооценкаКупона  Тогда
			ДооценкаКупона			 	= Выборка.ПереоценкаКупона;
			ДооценкаКупонаВВалютеУчета	= Выборка.ПереоценкаКупонаВВалютеУчета;
		Иначе	
			СтоимостьКупона  			 = Выборка.СтоимостьКупона;
			СтоимостьКупонаВВалютеУчета  = Выборка.СтоимостьКупонаВВалютеУчета;
			ПереоценкаКупона			 = Выборка.ПереоценкаКупона;
			ПереоценкаКупонаВВалютеУчета = Выборка.ПереоценкаКупонаВВалютеУчета;
		КонецЕсли;
	КонецЦикла;	
	
	Если ДооценкаИндексацииНоминала <> 0 Тогда
		
		АналитикаДоходовОтИндексацииНоминала = НастройкиУчетаАктиваОблигация.АналитикаДоходовИндексацииНоминала;
		СчетУчетаИндексацииНоминала = НастройкиУчетаАктиваОблигация.СчетУчетаИндексацииНоминала;
		
		ПараметрыИндексацииНоминала = Новый Структура("ЦеннаяБумага, ИндексацияНоминала, КупонныйДоход, ТаблицаНепринимаемойИндексацииНоминалов",
			Облигация, 
			ДооценкаИндексацииНоминала,  
			КоличествоПоПартиям * ДанныеДокумента.СуммаНаОднуОблигацию - СтоимостьКупона - ПереоценкаКупона,
			ТаблицаНепринимаемойИндексацииНоминалов);
		БухгалтерскийУчет.ДвижениеИндексацииНоминала(ДокументСсылка, Движения, ПараметрыИндексацииНоминала, АналитикаДоходовОтИндексацииНоминала, СчетУчетаИндексацииНоминала, ОбращаетсяНаОРЦБ, Отказ);
		
	КонецЕсли;
	
	Если ДооценкаКупонаВВалютеУчета <> 0 Тогда
	
		Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ДокументСсылка, Движения, ДооценкаКупонаВВалютеУчета, "Переоценка купона ценной бумаги");
		
		Проводка.СчетДт = НастройкиУчетаАктива.СчетУчетаПереоценки;
		Проводка.СубконтоДт.Облигации = Облигация;
		
		Если НастройкиУчетаАктива.СчетУчетаПереоценки.Валютный Тогда
			Проводка.ВалютнаяСуммаДт = Выборка.ПереоценкаКупонаДоначислено;
			Проводка.ВалютаДт = ВалютаНоминала;
		КонецЕсли;
		
		// кредит
		Проводка.СчетКт = ПланыСчетов.Основной.ПрочиеДоходы;
		Проводка.СубконтоКт.ПрочиеДоходыИРасходы = НастройкиУчетаАктива.АналитикаДоходовОтПереоценки;
		Проводка.СубконтоКт.ЦенныеБумаги         = Облигация;
		Проводка.СубконтоКт.ОбращаетсяНаОРЦБ     = ОбращаетсяНаОРЦБ;
	
	КонецЕсли;
	
	ПараметрыПогашенияКупона = Новый Структура("Облигация, ВЗалоге, КонтрагентЗалога, Дата, ОбращаетсяНаОРЦБ, СуммаКупона, СтоимостьКупона, СтоимостьКупонаВВалютеУчета, ПереоценкаКупона, ПереоценкаКупонаВВалютеУчета, 
		|ВалютаОплаты, ВалютаУчета, ВалютаНоминала, СчетПогашениеКупона", 
		Облигация, Ложь, Неопределено, Дата, ОбращаетсяНаОРЦБ, СуммаКупона, СтоимостьКупона, СтоимостьКупонаВВалютеУчета, ПереоценкаКупона, ПереоценкаКупонаВВалютеУчета, 
		ВалютаОплаты, ВалютаУчета, ВалютаНоминала, СчетПогашениеКупона);
	ОтразитьПогашениеКупонаПроводки(ДокументСсылка, Движения, УчетныйРегистр, НастройкиУчетаАктива, ПараметрыПогашенияКупона, Отказ);
	
	Возврат Движения;
	
КонецФункции // ПодготовитьНаборПроводок()	

Функция ПроводкиПоКупленнымПоРЕПО(ДокументСсылка, Движения, УчетныйРегистр, НастройкиУчетаАктива, НастройкиУчетаОблигация, УчетныйАктив, УчетныйАктивОблигация, ВалютаНоминала, ВалютаОплаты, ВалютаУчета, СчетПогашениеКупона, ОбращаетсяНаОРЦБ, ФормироватьПроводки, Отказ)

	АналитикаДебиторкиПоКупону = Справочники.ДополнительныеАналитикиЛицевыхСчетов.ЗадолженностьПоПогашениюКупона;
	
	ОтражатьЗадолженностьПоКупонуВЗалогеНаСчетеПогашенияКупона = БухгалтерскийУчет.ОпределитьНастройкуДляВидаУчета(
		ДокументСсылка.Дата, 
		ДокументСсылка.Организация, 
		ДокументСсылка.СчетДоверительногоУправления,
		УчетныйРегистр,
		"ОтражатьЗадолженностьПоКупонуВЗалогеНаСчетеПогашенияКупона");
		
	ФормироватьПроводкиОбратногоРЕПО = ФормироватьПроводки;
	
	РасчетныеНастройкиУчета = БухгалтерскийУчет.ОпределитьНастройкиУчета(ДокументСсылка.Дата, ДокументСсылка.Организация, ДокументСсылка.СчетДоверительногоУправления);
	ФормироватьПроводкиОбратногоРЕПО = НЕ РасчетныеНастройкиУчета.ОтражатьЗадолженностьПоПогашениюКупонаДляБумагКупленныхПоРЕПОПоФактуОплаты;
		
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.Текст = 	
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЗадолженностиПоЦеннымБумагамОстатки.Основание КАК Основание,
		|	ЗадолженностиПоЦеннымБумагамОстатки.ВидЗадолженности КАК ВидЗадолженности,
		|	ЗадолженностиПоЦеннымБумагамОстатки.ТипЗадолженности КАК ТипЗадолженности,
		|	ЗадолженностиПоЦеннымБумагамОстатки.КоличествоОстаток КАК КоличествоОстаток
		|ПОМЕСТИТЬ _ЗадолженностиПоЦеннымБумагамОстатки
		|ИЗ
		|	РегистрНакопления.ЗадолженностиПоЦеннымБумагам.Остатки(
		|			&ДатаФиксации,
		|			(ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоПервойЧастиРЕПО)
		|				ИЛИ ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоВторойЧастиРЕПО))
		|				И Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления
		|				И Рынок = &Рынок
		|				И ЦеннаяБумага = &ЦеннаяБумага) КАК ЗадолженностиПоЦеннымБумагамОстатки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ЗадолженностиПоЦеннымБумагамПоВторойЧастиРЕПО.Основание КАК Основание,
		|	ВЫБОР
		|		КОГДА _ЗадолженностиПоЦеннымБумагамПоВторойЧастиРЕПО.Основание.СделкаСЦентральнымКонтрагентом И &НКЦпоРЕПОсЦК
		|			ТОГДА _ЗадолженностиПоЦеннымБумагамПоВторойЧастиРЕПО.Основание.Контрагент
		|		КОГДА _ЗадолженностиПоЦеннымБумагамПоВторойЧастиРЕПО.Основание.Брокер <> ЗНАЧЕНИЕ(Справочник.БрокерскиеКомпании.ПустаяСсылка)
		|			ТОГДА _ЗадолженностиПоЦеннымБумагамПоВторойЧастиРЕПО.Основание.Брокер.ЮрФизЛицо
		|		ИНАЧЕ _ЗадолженностиПоЦеннымБумагамПоВторойЧастиРЕПО.Основание.Контрагент
		|	КОНЕЦ КАК Контрагент,
		|	0 КАК КоличествоОстаток,
		|	ВЫБОР
		|		КОГДА _ЗадолженностиПоЦеннымБумагамПоВторойЧастиРЕПО.ТипЗадолженности = ЗНАЧЕНИЕ(Перечисление.ТипыЗадолженности.Дебиторская)
		|			ТОГДА _ЗадолженностиПоЦеннымБумагамПоВторойЧастиРЕПО.КоличествоОстаток - ЕСТЬNULL(_ЗадолженностиПоЦеннымБумагамПоПервойЧастиРЕПО.КоличествоОстаток, 0)
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК КоличествоВРЕПО,
		|	ВЫБОР
		|		КОГДА _ЗадолженностиПоЦеннымБумагамПоВторойЧастиРЕПО.ТипЗадолженности = ЗНАЧЕНИЕ(Перечисление.ТипыЗадолженности.Кредиторская)
		|			ТОГДА _ЗадолженностиПоЦеннымБумагамПоВторойЧастиРЕПО.КоличествоОстаток - ЕСТЬNULL(_ЗадолженностиПоЦеннымБумагамПоПервойЧастиРЕПО.КоличествоОстаток, 0)
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК КоличествоПоРЕПО
		|ПОМЕСТИТЬ _КоличествоРЕПО
		|ИЗ
		|	_ЗадолженностиПоЦеннымБумагамОстатки КАК _ЗадолженностиПоЦеннымБумагамПоВторойЧастиРЕПО
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ЗадолженностиПоЦеннымБумагамОстатки КАК _ЗадолженностиПоЦеннымБумагамПоПервойЧастиРЕПО
		|		ПО _ЗадолженностиПоЦеннымБумагамПоВторойЧастиРЕПО.Основание = _ЗадолженностиПоЦеннымБумагамПоПервойЧастиРЕПО.Основание
		|			И (_ЗадолженностиПоЦеннымБумагамПоПервойЧастиРЕПО.ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоПервойЧастиРЕПО))
		|ГДЕ
		|	_ЗадолженностиПоЦеннымБумагамПоВторойЧастиРЕПО.ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоВторойЧастиРЕПО)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЗадолженностиПоВторойЧастиРЕПООстатки.СделкаРЕПО,
		|	ВЫБОР
		|		КОГДА ЗадолженностиПоВторойЧастиРЕПООстатки.СделкаРЕПО.СделкаСЦентральнымКонтрагентом И &НКЦпоРЕПОсЦК
		|			ТОГДА ЗадолженностиПоВторойЧастиРЕПООстатки.СделкаРЕПО.Контрагент
		|		КОГДА ЗадолженностиПоВторойЧастиРЕПООстатки.СделкаРЕПО.Брокер <> ЗНАЧЕНИЕ(Справочник.БрокерскиеКомпании.ПустаяСсылка)
		|			ТОГДА ЗадолженностиПоВторойЧастиРЕПООстатки.СделкаРЕПО.Брокер.ЮрФизЛицо
		|		ИНАЧЕ ЗадолженностиПоВторойЧастиРЕПООстатки.СделкаРЕПО.Контрагент
		|	КОНЕЦ,
		|	0,
		|	ВЫБОР
		|		КОГДА ЗадолженностиПоВторойЧастиРЕПООстатки.ТипЗадолженности = ЗНАЧЕНИЕ(Перечисление.ТипыЗадолженности.Кредиторская)
		|			ТОГДА ЗадолженностиПоВторойЧастиРЕПООстатки.КоличествоОстаток
		|		ИНАЧЕ 0
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА ЗадолженностиПоВторойЧастиРЕПООстатки.ТипЗадолженности = ЗНАЧЕНИЕ(Перечисление.ТипыЗадолженности.Дебиторская)
		|			ТОГДА ЗадолженностиПоВторойЧастиРЕПООстатки.КоличествоОстаток
		|		ИНАЧЕ 0
		|	КОНЕЦ
		|ИЗ
		|	РегистрНакопления.ЗадолженностиПоВторойЧастиРЕПО.Остатки(
		|			&ДатаФиксации,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления
		|				И Рынок = &Рынок
		|				И ЦеннаяБумага = &ЦеннаяБумага) КАК ЗадолженностиПоВторойЧастиРЕПООстатки
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	&Основание,
		|	ОстаткиЦенныхБумагОстатки.ЦеннаяБумага.Эмитент.ЮрФизЛицо,
		|	ОстаткиЦенныхБумагОстатки.КоличествоОстаток,
		|	0,
		|	0
		|ИЗ
		|	РегистрНакопления.ОстаткиЦенныхБумаг.Остатки(
		|			&ДатаФиксации,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления
		|				И Рынок = &Рынок
		|				И ЦеннаяБумага = &ЦеннаяБумага) КАК ОстаткиЦенныхБумагОстатки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_КоличествоРЕПО.Контрагент КАК Контрагент,
		|	_КоличествоРЕПО.Основание КАК Основание,
		|	СУММА(_КоличествоРЕПО.КоличествоОстаток) КАК КоличествоОстаток,
		|	СУММА(_КоличествоРЕПО.КоличествоВРЕПО) КАК КоличествоВРЕПО,
		|	СУММА(_КоличествоРЕПО.КоличествоПоРЕПО) КАК КоличествоПоРЕПО
		|ПОМЕСТИТЬ _КоличествоРЕПОСГруппировкой
		|ИЗ
		|	_КоличествоРЕПО КАК _КоличествоРЕПО
		|
		|СГРУППИРОВАТЬ ПО
		|	_КоличествоРЕПО.Контрагент,
		|	_КоличествоРЕПО.Основание
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СУММА(БухПартииЦенныхБумагПроданныеВРепо.СтоимостьКупона) КАК СтоимостьКупона,
		|	СУММА(БухПартииЦенныхБумагПроданныеВРепо.ПереоценкаКупона) КАК ПереоценкаКупона,
		|	СУММА(БухПартииЦенныхБумагПроданныеВРепо.СтоимостьКупонаВВалютеУчета) КАК СтоимостьКупонаВВалютеУчета,
		|	СУММА(БухПартииЦенныхБумагПроданныеВРепо.ПереоценкаКупонаВВалютеУчета) КАК ПереоценкаКупонаВВалютеУчета,
		|	ВЫБОР
		|		КОГДА БухПартииЦенныхБумагПроданныеВРепо.СтоимостьКупона = 0
		|				И БухПартииЦенныхБумагПроданныеВРепо.ПереоценкаКупона = 0
		|				И БухПартииЦенныхБумагПроданныеВРепо.ИндексацияНоминала = 0
		|				И БухПартииЦенныхБумагПроданныеВРепо.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК Перекурсовка,
		|	СУММА(БухПартииЦенныхБумагПроданныеВРепо.СтоимостьВВалютеУчета) КАК СтоимостьВВалютеУчета,
		|	СУММА(БухПартииЦенныхБумагПроданныеВРепо.ПереоценкаВВалютеУчета) КАК ПереоценкаВВалютеУчета,
		|	СУММА(БухПартииЦенныхБумагПроданныеВРепо.ИндексацияНоминала) КАК ИндексацияНоминала,
		|	ВЫБОР
		|		КОГДА БухПартииЦенныхБумагПроданныеВРепо.СтоимостьКупона = 0
		|				И БухПартииЦенныхБумагПроданныеВРепо.ПереоценкаКупона = 0
		|				И БухПартииЦенныхБумагПроданныеВРепо.ИндексацияНоминала <> 0
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК ДвижениеИндексацииНоминала,
		|	ВЫБОР
		|		КОГДА ТИПЗНАЧЕНИЯ(БухПартииЦенныхБумагПроданныеВРепо.ПродажаРЕПО) = ТИП(Документ.СделкаРЕПО)
		|			ТОГДА ВЫБОР
		|					КОГДА БухПартииЦенныхБумагПроданныеВРепо.ПродажаРЕПО.СделкаСЦентральнымКонтрагентом И &НКЦпоРЕПОсЦК
		|						ТОГДА БухПартииЦенныхБумагПроданныеВРепо.ПродажаРЕПО.Контрагент
		|					КОГДА БухПартииЦенныхБумагПроданныеВРепо.ПродажаРЕПО.Брокер <> ЗНАЧЕНИЕ(Справочник.БрокерскиеКомпании.ПустаяСсылка)
		|						ТОГДА БухПартииЦенныхБумагПроданныеВРепо.ПродажаРЕПО.Брокер.ЮрФизЛицо
		|					ИНАЧЕ БухПартииЦенныхБумагПроданныеВРепо.ПродажаРЕПО.Контрагент
		|				КОНЕЦ
		|		КОГДА ТИПЗНАЧЕНИЯ(БухПартииЦенныхБумагПроданныеВРепо.ПродажаРЕПО) = ТИП(Документ.ПоставкаЦенныхБумаг)
		|			ТОГДА ВЫБОР
		|					КОГДА БухПартииЦенныхБумагПроданныеВРепо.ПродажаРЕПО.Основание.Брокер <> ЗНАЧЕНИЕ(Справочник.БрокерскиеКомпании.ПустаяСсылка)
		|						ТОГДА БухПартииЦенныхБумагПроданныеВРепо.ПродажаРЕПО.Основание.Брокер.ЮрФизЛицо
		|					ИНАЧЕ БухПартииЦенныхБумагПроданныеВРепо.ПродажаРЕПО.Основание.Контрагент
		|				КОНЕЦ
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК Контрагент,
		|	ВЫБОР
		|		КОГДА БухПартииЦенныхБумагПроданныеВРепо.ПродажаРЕПО ССЫЛКА Документ.ПоставкаЦенныхБумаг
		|			ТОГДА ВЫРАЗИТЬ(БухПартииЦенныхБумагПроданныеВРепо.ПродажаРЕПО КАК Документ.ПоставкаЦенныхБумаг).Основание
		|		ИНАЧЕ БухПартииЦенныхБумагПроданныеВРепо.ПродажаРЕПО
		|	КОНЕЦ КАК ПродажаРЕПО
		|ПОМЕСТИТЬ _ДвиженияПартий
		|ИЗ
		|	РегистрНакопления.БухПартииЦенныхБумагПроданныеВРепо КАК БухПартииЦенныхБумагПроданныеВРепо
		|ГДЕ
		|	БухПартииЦенныхБумагПроданныеВРепо.Регистратор = &Регистратор
		|	И БухПартииЦенныхБумагПроданныеВРепо.ВидУчета = &ВидУчета
		|
		|СГРУППИРОВАТЬ ПО
		|	ВЫБОР
		|		КОГДА БухПартииЦенныхБумагПроданныеВРепо.СтоимостьКупона = 0
		|				И БухПартииЦенныхБумагПроданныеВРепо.ПереоценкаКупона = 0
		|				И БухПартииЦенныхБумагПроданныеВРепо.ИндексацияНоминала <> 0
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА ТИПЗНАЧЕНИЯ(БухПартииЦенныхБумагПроданныеВРепо.ПродажаРЕПО) = ТИП(Документ.СделкаРЕПО)
		|			ТОГДА ВЫБОР
		|					КОГДА БухПартииЦенныхБумагПроданныеВРепо.ПродажаРЕПО.СделкаСЦентральнымКонтрагентом И &НКЦпоРЕПОсЦК
		|						ТОГДА БухПартииЦенныхБумагПроданныеВРепо.ПродажаРЕПО.Контрагент
		|					КОГДА БухПартииЦенныхБумагПроданныеВРепо.ПродажаРЕПО.Брокер <> ЗНАЧЕНИЕ(Справочник.БрокерскиеКомпании.ПустаяСсылка)
		|						ТОГДА БухПартииЦенныхБумагПроданныеВРепо.ПродажаРЕПО.Брокер.ЮрФизЛицо
		|					ИНАЧЕ БухПартииЦенныхБумагПроданныеВРепо.ПродажаРЕПО.Контрагент
		|				КОНЕЦ
		|		КОГДА ТИПЗНАЧЕНИЯ(БухПартииЦенныхБумагПроданныеВРепо.ПродажаРЕПО) = ТИП(Документ.ПоставкаЦенныхБумаг)
		|			ТОГДА ВЫБОР
		|					КОГДА БухПартииЦенныхБумагПроданныеВРепо.ПродажаРЕПО.Основание.Брокер <> ЗНАЧЕНИЕ(Справочник.БрокерскиеКомпании.ПустаяСсылка)
		|						ТОГДА БухПартииЦенныхБумагПроданныеВРепо.ПродажаРЕПО.Основание.Брокер.ЮрФизЛицо
		|					ИНАЧЕ БухПартииЦенныхБумагПроданныеВРепо.ПродажаРЕПО.Основание.Контрагент
		|				КОНЕЦ
		|		ИНАЧЕ 0
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА БухПартииЦенныхБумагПроданныеВРепо.СтоимостьКупона = 0
		|				И БухПартииЦенныхБумагПроданныеВРепо.ПереоценкаКупона = 0
		|				И БухПартииЦенныхБумагПроданныеВРепо.ИндексацияНоминала = 0
		|				И БухПартииЦенныхБумагПроданныеВРепо.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА БухПартииЦенныхБумагПроданныеВРепо.ПродажаРЕПО ССЫЛКА Документ.ПоставкаЦенныхБумаг
		|			ТОГДА ВЫРАЗИТЬ(БухПартииЦенныхБумагПроданныеВРепо.ПродажаРЕПО КАК Документ.ПоставкаЦенныхБумаг).Основание
		|		ИНАЧЕ БухПартииЦенныхБумагПроданныеВРепо.ПродажаРЕПО
		|	КОНЕЦ";
			
	Запрос.УстановитьПараметр("Регистратор"					, ДокументСсылка);
	Запрос.УстановитьПараметр("ВидУчета"					, Перечисления.ВидыУчета[УчетныйРегистр]);
	Запрос.УстановитьПараметр("Приход",    	 ВидДвиженияНакопления.Приход);
	Запрос.УстановитьПараметр("ВидУчетаНУ",  Перечисления.ВидыУчета[УчетныйРегистр] = Перечисления.ВидыУчета.НалоговыйУчет);
	
	Запрос.УстановитьПараметр("СчетДоверительногоУправления", ДокументСсылка.СчетДоверительногоУправления);
	Запрос.УстановитьПараметр("Основание"					, ДокументСсылка);
	Запрос.УстановитьПараметр("Организация"					, ДокументСсылка.Организация);
	Запрос.УстановитьПараметр("Рынок"						, Перечисления.РынкиЦенныхБумаг.Облигации);
	Запрос.УстановитьПараметр("ЦеннаяБумага"				, ДокументСсылка.Облигация);
	Запрос.УстановитьПараметр("ДатаФиксации"				, ?(ДокументСсылка.ДатаФиксации = НачалоДня(ДокументСсылка.Дата), НачалоДня(ДокументСсылка.ДатаФиксации), КонецДня(ДокументСсылка.ДатаФиксации)));
	Запрос.УстановитьПараметр("НКЦпоРЕПОсЦК"				, НКЦпоРЕПОсЦК(ДокументСсылка.Дата));
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "НалоговыйУчет", УчетныйРегистр);
	
	//ловим погрешность округления
	ОбщееКоличество = ДокументСсылка.Количество;
	ОбщаяСуммаКРаспределению = ДокументСсылка.СуммаКупона;
	ОбщееКоличествоПоРЕПО = 0;
	ОбщаяСуммаПоРЕПО = 0;
	ОбщееКоличествоВРЕПО = 0;
	ОбщаяСуммаВРЕПО = 0;
	
	СтруктураОбъекта = Новый Структура("Ссылка, Дата, Движения", ДокументСсылка, ДокументСсылка.Дата, Движения); 
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ТаблицаЗначенийПрямоеРЕПО = Запрос.МенеджерВременныхТаблиц.Таблицы["_ДвиженияПартий"].ПолучитьДанные().Выгрузить();
	
	Выборка = Запрос.МенеджерВременныхТаблиц.Таблицы["_КоличествоРЕПОСГруппировкой"].ПолучитьДанные().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		Если ЗначениеЗаполнено(Выборка.КоличествоПоРЕПО) Тогда
		
			КоличествоПоРЕПО = Выборка.КоличествоПоРЕПО;
			СуммаПоРЕПО = Окр(ОбщаяСуммаКРаспределению / ОбщееКоличество * КоличествоПоРЕПО, 2);
			
			ОбщаяСуммаКРаспределению = ОбщаяСуммаКРаспределению - СуммаПоРЕПО;
			ОбщееКоличество = ОбщееКоличество - КоличествоПоРЕПО;
			ОбщаяСуммаПоРЕПО = ОбщаяСуммаПоРЕПО + СуммаПоРЕПО;
			ОбщееКоличествоПоРЕПО = ОбщееКоличествоПоРЕПО + КоличествоПоРЕПО;
			
			Если ФормироватьПроводкиОбратногоРЕПО Тогда 
				Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ДокументСсылка, Движения, РаботаСВалютами.ПолучитьСуммуВВалютеУчета(СуммаПоРЕПО, ДокументСсылка.ВалютаОплаты, ДокументСсылка.Организация, ДокументСсылка.Дата, Отказ), "Погашение купона по ЦБ, купленым по РЕПО");
				
				// дебет
				Проводка.СчетДт = СчетПогашениеКупона;
				Проводка.СубконтоДт.Облигации = ДокументСсылка.Облигация;
				
				Если СчетПогашениеКупона.Валютный Тогда
					Проводка.ВалютнаяСуммаДт = СуммаПоРЕПО;
					Проводка.ВалютаДт = ДокументСсылка.ВалютаОплаты;
				КонецЕсли;
				
				Если СчетПогашениеКупона = ПланыСчетов.Основной.ПогашениеКупонаЕврооблигации Тогда
					Проводка.СубконтоДт.ОснованиеРасчетов = ДокументСсылка;
				КонецЕсли;			
				
				// кредит
				Если ВалютаОплаты <> ВалютаУчета Тогда
					
					Проводка.СчетКт = ПланыСчетов.Основной.РасчетыСДебиторамиИКредиторамиВВалюте;
					
					Проводка.ВалютнаяСуммаКт = СуммаПоРЕПО;
					Проводка.ВалютаКт = ДокументСсылка.ВалютаОплаты;
					
				Иначе
					
					Проводка.СчетКт = ПланыСчетов.Основной.РасчетыСДебиторамиИКредиторамиВРублях;
					
				КонецЕсли;
				
				Проводка.СубконтоКт.Контрагенты 		= Выборка.Контрагент;
				
			КонецЕсли;	
			
		КонецЕсли;
			
		Если ЗначениеЗаполнено(Выборка.КоличествоВРЕПО) Тогда
			
			//СтрокиВРЕПО =ТаблицаЗначенийПрямоеРЕПО.НайтиСтроки(Новый Структура("Контрагент", Выборка.Контрагент));
			СтрокиВРЕПО =ТаблицаЗначенийПрямоеРЕПО.НайтиСтроки(Новый Структура("Контрагент, ПродажаРЕПО", Выборка.Контрагент, Выборка.Основание));
			КоличествоВРЕПО = 0;
			
			Для каждого СтрокаВРЕПО из СтрокиВРЕПО Цикл
				Если СтрокаВРЕПО.Перекурсовка  Тогда
					
					//ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не сформированы проводки перекурсовки для проданных в РЕПО партий", ДокументСсылка,,,Отказ);
					//Прервать;
					
					ПараметрыПерекурсовки = Новый Структура("ЦеннаяБумага, Рынок,"
						+ "СтоимостьВВалютеУчета, СтоимостьКупонаВВалютеУчета, ПереоценкаВВалютеУчета, ПереоценкаКупонаВВалютеУчета",
						ДокументСсылка.Облигация, Перечисления.РынкиЦенныхБумаг.Облигации,
						СтрокаВРЕПО.СтоимостьВВалютеУчета, СтрокаВРЕПО.СтоимостьКупонаВВалютеУчета, СтрокаВРЕПО.ПереоценкаВВалютеУчета, СтрокаВРЕПО.ПереоценкаКупонаВВалютеУчета);
						
					СчетаУчета = Новый Структура;
					СчетаУчета.Вставить(УчетныйАктив.ИмяПредопределенныхДанных, НастройкиУчетаАктива.СчетУчетаВЗалоге);
					СчетаУчета.Вставить(УчетныйАктивОблигация.ИмяПредопределенныхДанных, НастройкиУчетаОблигация.СчетУчетаВЗалоге);
					
					СчетаУчетаПереоценки = Новый Структура;
					СчетаУчетаПереоценки.Вставить(УчетныйАктив.ИмяПредопределенныхДанных, НастройкиУчетаАктива.СчетУчетаПереоценкиВЗалоге);
					СчетаУчетаПереоценки.Вставить(УчетныйАктивОблигация.ИмяПредопределенныхДанных, НастройкиУчетаОблигация.СчетУчетаПереоценкиВЗалоге);
					
					АналитикаПерекурсовки = Новый Структура;
					АналитикаПерекурсовки.Вставить(УчетныйАктив.ИмяПредопределенныхДанных, НастройкиУчетаАктива.АналитикаПерекурсовки);
					АналитикаПерекурсовки.Вставить(УчетныйАктивОблигация.ИмяПредопределенныхДанных, НастройкиУчетаОблигация.АналитикаПерекурсовки);
					
					БухгалтерскийУчет.ДвижениеПерекурсовки(СтруктураОбъекта, УчетныйРегистр, ПараметрыПерекурсовки, АналитикаПерекурсовки,  СчетаУчета, СчетаУчетаПереоценки, ОбращаетсяНаОРЦБ, Отказ);		
					
				ИначеЕсли СтрокаВРЕПО.ДвижениеИндексацииНоминала  Тогда
					
					ДооценкаИндексацииНоминала	 = СтрокаВРЕПО.ИндексацияНоминала;
					
				Иначе	
					КоличествоВРЕПО = Выборка.КоличествоВРЕПО;
					СуммаВРЕПО = Окр(КоличествоВРЕПО * ДокументСсылка.СуммаНаОднуОблигацию, 2);
					
					ОбщаяСуммаКРаспределению = ОбщаяСуммаКРаспределению - СуммаВРЕПО;
					ОбщееКоличество = ОбщееКоличество - КоличествоВРЕПО;
					ОбщаяСуммаВРЕПО = ОбщаяСуммаВРЕПО + СуммаВРЕПО;
					ОбщееКоличествоВРЕПО = ОбщееКоличествоВРЕПО + КоличествоВРЕПО;
					
					Если ФормироватьПроводки Тогда						
						ПараметрыПогашенияКупона = Новый Структура("Облигация, ВЗалоге, КонтрагентЗалога, Дата, ОбращаетсяНаОРЦБ, СуммаКупона, СтоимостьКупона, СтоимостьКупонаВВалютеУчета, ПереоценкаКупона, ПереоценкаКупонаВВалютеУчета, 
							|ВалютаОплаты, ВалютаУчета, ВалютаНоминала, СчетПогашениеКупона, ОтражатьЗадолженностьПоКупонуВЗалогеНаСчетеПогашенияКупона, СделкаРЕПО", 
							ДокументСсылка.Облигация, Истина, Выборка.Контрагент, ДокументСсылка.Дата, ОбращаетсяНаОРЦБ, СуммаВРЕПО, 
							СтрокаВРЕПО.СтоимостьКупона, СтрокаВРЕПО.СтоимостьКупонаВВалютеУчета, СтрокаВРЕПО.ПереоценкаКупона, СтрокаВРЕПО.ПереоценкаКупонаВВалютеУчета, 
							ВалютаОплаты, ВалютаУчета, ВалютаНоминала, СчетПогашениеКупона, ОтражатьЗадолженностьПоКупонуВЗалогеНаСчетеПогашенияКупона, СтрокаВРЕПО.ПродажаРЕПО);
						ОтразитьПогашениеКупонаПроводки(ДокументСсылка, Движения, УчетныйРегистр, НастройкиУчетаАктива, ПараметрыПогашенияКупона, Отказ);						
					КонецЕсли;
				
					ТаблицаЗначенийПрямоеРЕПО.Удалить(СтрокаВРЕПО);
					
				КонецЕсли;
				
			КонецЦикла;
						
			Если КоличествоВРЕПО = 0 Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не найдены проданные в РЕПО партии для контрагента " + Выборка.Контрагент, ДокументСсылка,,,Отказ);
				Прервать;	
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Новый Структура("КоличествоПоРЕПО, СуммаПоРЕПО, КоличествоВРЕПО, СуммаВРЕПО", ОбщееКоличествоПоРЕПО, ОбщаяСуммаПоРЕПО, ОбщееКоличествоВРЕПО, ОбщаяСуммаВРЕПО);

КонецФункции

Процедура ОтразитьПогашениеКупонаПроводки(ДокументСсылка, Движения, УчетныйРегистр, НастройкиУчетаАктива, ПараметрыПогашенияКупона, Отказ)
	
	Облигация 						= ПараметрыПогашенияКупона.Облигация;
	ВЗалоге 						= ПараметрыПогашенияКупона.ВЗалоге;
	ОбращаетсяНаОРЦБ				= ПараметрыПогашенияКупона.ОбращаетсяНаОРЦБ;
	ВалютаОплаты 					= ПараметрыПогашенияКупона.ВалютаОплаты;
	ВалютаУчета 					= ПараметрыПогашенияКупона.ВалютаУчета;
	ВалютаНоминала 					= ПараметрыПогашенияКупона.ВалютаНоминала;
	Дата 							= ПараметрыПогашенияКупона.Дата;
	СуммаКупона 					= ПараметрыПогашенияКупона.СуммаКупона;
	СтоимостьКупона 				= ПараметрыПогашенияКупона.СтоимостьКупона;
	СтоимостьКупонаВВалютеУчета 	= ПараметрыПогашенияКупона.СтоимостьКупонаВВалютеУчета;
	ПереоценкаКупона 				= ПараметрыПогашенияКупона.ПереоценкаКупона;
	ПереоценкаКупонаВВалютеУчета 	= ПараметрыПогашенияКупона.ПереоценкаКупонаВВалютеУчета;
	СчетПогашениеКупона 			= ПараметрыПогашенияКупона.СчетПогашениеКупона;
	
	// #Технический долг - нужно это правильно сделать
	ЭтоБанкрот = Ложь;
	Если Облигация.Эмитент = ОбщегоНазначения.ПолучитьИменованныйОбъект("Эмитент_Прайм") И Дата >= '20190913' Тогда
		ЭтоБанкрот = Истина;
	КонецЕсли;
	
	Контрагент = Неопределено;
	ПараметрыПогашенияКупона.Свойство("КонтрагентЗалога", Контрагент);
	ОтражатьЗадолженностьПоКупонуВЗалогеНаСчетеПогашенияКупона = Неопределено;
	ПараметрыПогашенияКупона.Свойство("ОтражатьЗадолженностьПоКупонуВЗалогеНаСчетеПогашенияКупона", ОтражатьЗадолженностьПоКупонуВЗалогеНаСчетеПогашенияКупона);
	СделкаРЕПО = Неопределено;
	ПараметрыПогашенияКупона.Свойство("СделкаРЕПО", СделкаРЕПО);
		
	
	Если ЭтоБанкрот Тогда // для банкротов в доход идет только себестоимость купона
		
		СуммаКупона = 0;
		
		Если НастройкиУчетаАктива.СчетУчета <> НастройкиУчетаАктива.СчетУчетаПереоценки Тогда
		    СуммаКупона = СуммаКупона + ПереоценкаКупона;
		КонецЕсли;
		
		Если Не НастройкиУчетаАктива.ОтражатьНаПереоценкеПолнуюСумму Тогда
		    СуммаКупона = СуммаКупона + СтоимостьКупона;
		КонецЕсли;
	
	КонецЕсли;
	
	ОтражатьВДоходеТолькоРазницу = НастройкиУчетаАктива.ПриПогашенииВДоходеОтражатьТолькоРазницу; 
	
	Если СуммаКупона <> 0  Тогда
		//Дт Счет7654 Кт СчетДоходы Сумма = ЭтотОбъект.СуммаКупона
		Если НЕ ОтражатьВДоходеТолькоРазницу Тогда  
			Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ДокументСсылка, Движения, РаботаСВалютами.ПересчетСуммыВВалюте(СуммаКупона, ВалютаОплаты, Дата, ВалютаУчета, Дата, Отказ), "Доход от погашения купона");
			
			// дебет
			Проводка.СчетДт = СчетПогашениеКупона;
			Проводка.СубконтоДт.Облигации = Облигация;
			
			Если СчетПогашениеКупона.Валютный Тогда
				Если ВалютаОплаты <> ВалютаУчета Тогда
					Проводка.ВалютнаяСуммаДт = РаботаСВалютами.ПересчетСуммыВВалюте(СуммаКупона, ВалютаНоминала, Дата, ВалютаОплаты, Дата, Отказ);
				Иначе
					Проводка.ВалютнаяСуммаДт = СуммаКупона;
				КонецЕсли;	
				Проводка.ВалютаДт = ВалютаОплаты;
			КонецЕсли;
			
			Если СчетПогашениеКупона = ПланыСчетов.Основной.ПогашениеКупонаЕврооблигации Тогда
				Проводка.СубконтоДт.ОснованиеРасчетов = ДокументСсылка; 
			КонецЕсли;	
			
			// кредит
			Проводка.СчетКт = ПланыСчетов.Основной.ПрочиеДоходы;
			Проводка.СубконтоКт.ПрочиеДоходыИРасходы = НастройкиУчетаАктива.АналитикаДоходов;
			Проводка.СубконтоКт.ЦенныеБумаги         = Облигация;
			Проводка.СубконтоКт.ОбращаетсяНаОРЦБ     = ОбращаетсяНаОРЦБ;
		Конецесли;
		
		Если ВЗалоге И НЕ ОтражатьЗадолженностьПоКупонуВЗалогеНаСчетеПогашенияКупона Тогда
			
			Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ДокументСсылка, Движения, РаботаСВалютами.ПересчетСуммыВВалюте(СуммаКупона, ВалютаОплаты, Дата, ВалютаУчета, Дата, Отказ), "Доход от погашения купона");
			
			Если ВалютаОплаты <> ВалютаУчета Тогда
				Проводка.СчетДт = ПланыСчетов.Основной.РасчетыСДебиторамиИКредиторамиВВалюте;
				Если ВалютаОплаты <> ВалютаУчета Тогда
					Проводка.ВалютнаяСуммаДт = РаботаСВалютами.ПересчетСуммыВВалюте(СуммаКупона, ВалютаНоминала, Дата, ВалютаОплаты, Дата, Отказ);
				Иначе
					Проводка.ВалютнаяСуммаДт = СуммаКупона;
				КонецЕсли;	
				Проводка.ВалютаДт = ВалютаОплаты;
			Иначе
				Проводка.СчетДт = ПланыСчетов.Основной.РасчетыСДебиторамиИКредиторамиВРублях;
			КонецЕсли;	
			Проводка.СубконтоДт.Контрагенты 		= Контрагент;
			
			Проводка.СчетКт = СчетПогашениеКупона;
			Проводка.СубконтоКт.Облигации = Облигация;
			
			Если СчетПогашениеКупона.Валютный Тогда
				Если ВалютаОплаты <> ВалютаУчета Тогда
					Проводка.ВалютнаяСуммаКт = РаботаСВалютами.ПересчетСуммыВВалюте(СуммаКупона, ВалютаНоминала, Дата, ВалютаОплаты, Дата, Отказ);
				Иначе
					Проводка.ВалютнаяСуммаКт = СуммаКупона;
				КонецЕсли;	
				Проводка.ВалютаКт = ВалютаОплаты;
			КонецЕсли;
			
			Если СчетПогашениеКупона = ПланыСчетов.Основной.ПогашениеКупонаЕврооблигации Тогда
				Проводка.СубконтоКт.ОснованиеРасчетов = ДокументСсылка;
			КонецЕсли;			
			
		КонецЕсли;	
	КонецЕсли;
	
	Если ПереоценкаКупона <> 0 И НастройкиУчетаАктива.СчетУчета <> НастройкиУчетаАктива.СчетУчетаПереоценки Тогда
		
		//Дт СчетРасходы Кт СчетУчетаПереоценки = ПереоценкаКупона
		Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ДокументСсылка, Движения, ПереоценкаКупонаВВалютеУчета, "Переоценка купона в расход");
		
		// дебет
		Если  НЕ ОтражатьВДоходеТолькоРазницу Тогда 
			Проводка.СчетДт = ПланыСчетов.Основной.ПрочиеРасходы;
			
			Если УчетныйРегистр = "НалоговыйУчет" Тогда
				Проводка.СубконтоДт.ПрочиеДоходыИРасходы = НастройкиУчетаАктива.АналитикаДоходовОтПереоценки;
			Иначе
				Проводка.СубконтоДт.ПрочиеДоходыИРасходы = НастройкиУчетаАктива.АналитикаДоходов;
			КонецЕсли;
			
			Проводка.СубконтоДт.ЦенныеБумаги     = Облигация;
			Проводка.СубконтоДт.ОбращаетсяНаОРЦБ = ОбращаетсяНаОРЦБ;
		Иначе
			Проводка.СчетДт = СчетПогашениеКупона;
			Проводка.СубконтоДт.Облигации = Облигация;
			
			Если СчетПогашениеКупона.Валютный Тогда
				Если ВалютаОплаты <> ВалютаУчета Тогда
					Проводка.ВалютнаяСуммаДт = РаботаСВалютами.ПересчетСуммыВВалюте(СуммаКупона, ВалютаНоминала, Дата, ВалютаОплаты, Дата, Отказ);
				Иначе
					Проводка.ВалютнаяСуммаДт = СуммаКупона;
				КонецЕсли;	
				Проводка.ВалютаДт = ВалютаОплаты;
			КонецЕсли;		
			
			Если СчетПогашениеКупона = ПланыСчетов.Основной.ПогашениеКупонаЕврооблигации Тогда
				Проводка.СубконтоДт.ОснованиеРасчетов = ДокументСсылка; 
			КонецЕсли;				
		КонецЕсли;
		
		// кредит
		Проводка.СчетКт = ?(ВЗалоге, НастройкиУчетаАктива.СчетУчетаПереоценкиВЗалоге, НастройкиУчетаАктива.СчетУчетаПереоценки);
		Проводка.СубконтоКт.Облигации = Облигация;
		
		Если Проводка.СчетКт.Валютный Тогда
			Проводка.ВалютнаяСуммаКт = ПереоценкаКупона;
			Проводка.ВалютаКт = ВалютаНоминала;
		КонецЕсли;
		
	КонецЕсли;
	
	Если Не НастройкиУчетаАктива.ОтражатьНаПереоценкеПолнуюСумму Тогда
		Если СтоимостьКупона <> 0 Тогда
			//Дт СчетРасходы Кт СчетУчета Сумма = СтоимостьКупона
			Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ДокументСсылка, Движения, СтоимостьКупонаВВалютеУчета, "Купон в расход");
			
			// дебет
			Если  НЕ ОтражатьВДоходеТолькоРазницу Тогда 			
				Проводка.СчетДт = ПланыСчетов.Основной.ПрочиеРасходы;
				Проводка.СубконтоДт.ПрочиеДоходыИРасходы = НастройкиУчетаАктива.АналитикаДоходов;
				Проводка.СубконтоДт.ЦенныеБумаги         = Облигация;
				Проводка.СубконтоДт.ОбращаетсяНаОРЦБ     = ОбращаетсяНаОРЦБ;
			Иначе
				Проводка.СчетДт = СчетПогашениеКупона;
				Проводка.СубконтоДт.Облигации = Облигация;
				
				Если СчетПогашениеКупона.Валютный Тогда
					Если ВалютаОплаты <> ВалютаУчета Тогда
						Проводка.ВалютнаяСуммаДт = РаботаСВалютами.ПересчетСуммыВВалюте(СуммаКупона, ВалютаНоминала, Дата, ВалютаОплаты, Дата, Отказ);
					Иначе
						Проводка.ВалютнаяСуммаДт = СуммаКупона;
					КонецЕсли;
					Проводка.ВалютаДт = ВалютаОплаты;
				КонецЕсли;	
				
				Если СчетПогашениеКупона = ПланыСчетов.Основной.ПогашениеКупонаЕврооблигации Тогда
					Проводка.СубконтоДт.ОснованиеРасчетов = ДокументСсылка; 
				КонецЕсли;	
				
			КонецЕсли;
			// кредит
			Проводка.СчетКт = ?(ВЗалоге, НастройкиУчетаАктива.СчетУчетаВЗалоге, НастройкиУчетаАктива.СчетУчета);
			Проводка.СубконтоКт.Облигации = Облигация;
			
			Если Проводка.СчетКт.Валютный Тогда
				Проводка.ВалютнаяСуммаКт = СтоимостьКупона;
				Проводка.ВалютаКт = ВалютаНоминала;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Функция ПроводкиПоКупленнымПоРЕПОЕПС(ДокументСсылка, Движения) Экспорт

	АналитикаДебиторкиПоКупону = Справочники.ДополнительныеАналитикиЛицевыхСчетов.ЗадолженностьПоПогашениюКупона;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 	
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЗадолженностиПоЦеннымБумагамОстатки.Основание,
		|	ЗадолженностиПоЦеннымБумагамОстатки.ВидЗадолженности,
		|	ЗадолженностиПоЦеннымБумагамОстатки.ТипЗадолженности,
		|	ЗадолженностиПоЦеннымБумагамОстатки.КоличествоОстаток
		|ПОМЕСТИТЬ ВТ_ЗадолженностиПоЦеннымБумагамОстатки
		|ИЗ
		|	РегистрНакопления.ЗадолженностиПоЦеннымБумагам.Остатки(
		|			&ДатаФиксации,
		|			(ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоПервойЧастиРЕПО)
		|				ИЛИ ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоВторойЧастиРЕПО))
		|				И Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления
		|				И Рынок = &Рынок
		|				И ЦеннаяБумага = &ЦеннаяБумага) КАК ЗадолженностиПоЦеннымБумагамОстатки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВТ_ЗадолженностиПоЦеннымБумагамПоВторойЧастиРЕПО.Основание,
		|	ВЫБОР
		|		КОГДА ВТ_ЗадолженностиПоЦеннымБумагамПоВторойЧастиРЕПО.Основание.СделкаСЦентральнымКонтрагентом И &НКЦпоРЕПОсЦК
		|			ТОГДА ВТ_ЗадолженностиПоЦеннымБумагамПоВторойЧастиРЕПО.Основание.Контрагент
		|		КОГДА ВТ_ЗадолженностиПоЦеннымБумагамПоВторойЧастиРЕПО.Основание.Брокер <> ЗНАЧЕНИЕ(Справочник.БрокерскиеКомпании.ПустаяСсылка)
		|			ТОГДА ВТ_ЗадолженностиПоЦеннымБумагамПоВторойЧастиРЕПО.Основание.Брокер.ЮрФизЛицо
		|		ИНАЧЕ ВТ_ЗадолженностиПоЦеннымБумагамПоВторойЧастиРЕПО.Основание.Контрагент
		|	КОНЕЦ КАК Контрагент,
		|	0 КАК КоличествоОстаток,
		|	ВЫБОР
		|		КОГДА ВТ_ЗадолженностиПоЦеннымБумагамПоВторойЧастиРЕПО.ТипЗадолженности = ЗНАЧЕНИЕ(Перечисление.ТипыЗадолженности.Дебиторская)
		|			ТОГДА ВТ_ЗадолженностиПоЦеннымБумагамПоВторойЧастиРЕПО.КоличествоОстаток - ЕСТЬNULL(ВТ_ЗадолженностиПоЦеннымБумагамПоПервойЧастиРЕПО.КоличествоОстаток, 0)
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК КоличествоВРЕПО,
		|	ВЫБОР
		|		КОГДА ВТ_ЗадолженностиПоЦеннымБумагамПоВторойЧастиРЕПО.ТипЗадолженности = ЗНАЧЕНИЕ(Перечисление.ТипыЗадолженности.Кредиторская)
		|			ТОГДА ВТ_ЗадолженностиПоЦеннымБумагамПоВторойЧастиРЕПО.КоличествоОстаток - ЕСТЬNULL(ВТ_ЗадолженностиПоЦеннымБумагамПоПервойЧастиРЕПО.КоличествоОстаток, 0)
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК КоличествоПоРЕПО
		|ПОМЕСТИТЬ ВТ_КоличествоРЕПО
		|ИЗ
		|	ВТ_ЗадолженностиПоЦеннымБумагамОстатки КАК ВТ_ЗадолженностиПоЦеннымБумагамПоВторойЧастиРЕПО
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ЗадолженностиПоЦеннымБумагамОстатки КАК ВТ_ЗадолженностиПоЦеннымБумагамПоПервойЧастиРЕПО
		|		ПО ВТ_ЗадолженностиПоЦеннымБумагамПоВторойЧастиРЕПО.Основание = ВТ_ЗадолженностиПоЦеннымБумагамПоПервойЧастиРЕПО.Основание
		|			И (ВТ_ЗадолженностиПоЦеннымБумагамПоПервойЧастиРЕПО.ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоПервойЧастиРЕПО))
		|ГДЕ
		|	ВТ_ЗадолженностиПоЦеннымБумагамПоВторойЧастиРЕПО.ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоВторойЧастиРЕПО)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЗадолженностиПоВторойЧастиРЕПООстатки.СделкаРЕПО,
		|	ВЫБОР
		|		КОГДА ЗадолженностиПоВторойЧастиРЕПООстатки.СделкаРЕПО.СделкаСЦентральнымКонтрагентом И &НКЦпоРЕПОсЦК
		|			ТОГДА ЗадолженностиПоВторойЧастиРЕПООстатки.СделкаРЕПО.Контрагент
		|		КОГДА ЗадолженностиПоВторойЧастиРЕПООстатки.СделкаРЕПО.Брокер <> ЗНАЧЕНИЕ(Справочник.БрокерскиеКомпании.ПустаяСсылка)
		|			ТОГДА ЗадолженностиПоВторойЧастиРЕПООстатки.СделкаРЕПО.Брокер.ЮрФизЛицо
		|		ИНАЧЕ ЗадолженностиПоВторойЧастиРЕПООстатки.СделкаРЕПО.Контрагент
		|	КОНЕЦ,
		|	0,
		|	ВЫБОР
		|		КОГДА ЗадолженностиПоВторойЧастиРЕПООстатки.ТипЗадолженности = ЗНАЧЕНИЕ(Перечисление.ТипыЗадолженности.Кредиторская)
		|			ТОГДА ЗадолженностиПоВторойЧастиРЕПООстатки.КоличествоОстаток
		|		ИНАЧЕ 0
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА ЗадолженностиПоВторойЧастиРЕПООстатки.ТипЗадолженности = ЗНАЧЕНИЕ(Перечисление.ТипыЗадолженности.Дебиторская)
		|			ТОГДА ЗадолженностиПоВторойЧастиРЕПООстатки.КоличествоОстаток
		|		ИНАЧЕ 0
		|	КОНЕЦ
		|ИЗ
		|	РегистрНакопления.ЗадолженностиПоВторойЧастиРЕПО.Остатки(
		|			&ДатаФиксации,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления
		|				И Рынок = &Рынок
		|				И ЦеннаяБумага = &ЦеннаяБумага) КАК ЗадолженностиПоВторойЧастиРЕПООстатки
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	&Основание,
		|	ОстаткиЦенныхБумагОстатки.ЦеннаяБумага.Эмитент.ЮрФизЛицо,
		|	ОстаткиЦенныхБумагОстатки.КоличествоОстаток,
		|	0,
		|	0
		|ИЗ
		|	РегистрНакопления.ОстаткиЦенныхБумаг.Остатки(
		|			&ДатаФиксации,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления
		|				И Рынок = &Рынок
		|				И ЦеннаяБумага = &ЦеннаяБумага) КАК ОстаткиЦенныхБумагОстатки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВТ_КоличествоРЕПО.Основание,
		|	ВТ_КоличествоРЕПО.Контрагент,
		|	ВТ_КоличествоРЕПО.КоличествоОстаток,
		|	ВТ_КоличествоРЕПО.КоличествоВРЕПО,
		|	ВТ_КоличествоРЕПО.КоличествоПоРЕПО
		|ИЗ
		|	ВТ_КоличествоРЕПО КАК ВТ_КоличествоРЕПО";
		
	Запрос.УстановитьПараметр("СчетДоверительногоУправления", ДокументСсылка.СчетДоверительногоУправления);
	Запрос.УстановитьПараметр("Основание"					, ДокументСсылка);
	Запрос.УстановитьПараметр("Организация"					, ДокументСсылка.Организация);
	Запрос.УстановитьПараметр("Рынок"						, Перечисления.РынкиЦенныхБумаг.Облигации);
	Запрос.УстановитьПараметр("ЦеннаяБумага"				, ДокументСсылка.Облигация);
	Запрос.УстановитьПараметр("ДатаФиксации"				, ?(ДокументСсылка.ДатаФиксации = НачалоДня(ДокументСсылка.Дата), НачалоДня(ДокументСсылка.ДатаФиксации), КонецДня(ДокументСсылка.ДатаФиксации)));
	Запрос.УстановитьПараметр("НКЦпоРЕПОсЦК"				, НКЦпоРЕПОсЦК(ДокументСсылка.Дата));
	
	ОбщееКоличествоПоРЕПО = 0;
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		Если ЗначениеЗаполнено(Выборка.КоличествоПоРЕПО) Тогда
		
			КоличествоПоРЕПО = Выборка.КоличествоПоРЕПО;
			СуммаПоРЕПО = КоличествоПоРЕПО * ДокументСсылка.СуммаНаОднуОблигацию;
			
			ОбщееКоличествоПоРЕПО = ОбщееКоличествоПоРЕПО + КоличествоПоРЕПО;
			
			Если Движения <> Неопределено Тогда
			
				Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ДокументСсылка, Движения, СуммаПоРЕПО, "Погашение купона по ЦБ, купленым по РЕПО");
				
				Проводка.Период = Движения.Отбор.Регистратор.Значение.Дата;
				
				// дебет
				Проводка.СчетДт = ПланыСчетов.Единый.Расчеты23;
				
				Проводка.СубконтоДт.Контрагенты 		= ДокументСсылка.Облигация.Эмитент.ЮрФизЛицо;
				Проводка.СубконтоДт.ОснованиеРасчетов 	= ДокументСсылка;
				
				Проводка.ВалютаДт = ДокументСсылка.ВалютаОплаты;
				Проводка.ВалютнаяСуммаДт = СуммаПоРЕПО;
				
				Проводка.ДополнительнаяАналитикаДт = АналитикаДебиторкиПоКупону;
				
				// кредит
				Проводка.СчетКт = ПланыСчетов.Единый.Расчеты22;
				
				Проводка.СубконтоКт.Контрагенты 		= Выборка.Контрагент;
				Проводка.СубконтоКт.ОснованиеРасчетов 	= Выборка.Основание;
				
				Проводка.ВалютаКт 			= ДокументСсылка.ВалютаОплаты;
				Проводка.ВалютнаяСуммаКт 	= СуммаПоРЕПО;
				
				Проводка.ДополнительнаяАналитикаКт = АналитикаДебиторкиПоКупону;
			
			КонецЕсли;			
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат ОбщееКоличествоПоРЕПО;

КонецФункции
